Table of Contents
 Class MatConcreteEc2
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Material concrete Ec2
[OpenModelClass("CI.StructModel.Libraries.Material.ECEN.MatConcreteECEN,CI.Material", "CI.StructModel.Libraries.Material.IMaterial,CI.BasicTypes", typeof(MatConcrete))]
public class MatConcreteEc2 : MatConcrete
Inheritance
object
OpenObject
OpenElementId
Material
MatConcrete
MatConcreteEc2
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Examples
This sample shows how to create concrete material.
//Creating the model
OpenModel openModel = new OpenModel();
//Cocrete material
MatConcreteEc2 mat = new MatConcreteEc2();
mat.Name = "Concrete1";
mat.UnitMass = 2500.0;
mat.E = 32.8e9;
mat.G = 13.667e9;
mat.Poisson = 0.2;
mat.SpecificHeat = 0.6;
mat.ThermalExpansion = 0.00001;
mat.ThermalConductivity = 45;
mat.Fck = 25.5e6;
mat.CalculateDependentValues = true;
//Set s-s diagram as a default parabolic
mat.DiagramType = ConcDiagramType.Parabolic;
//Set s-s diagram as an user defined
mat.DiagramType = ConcDiagramType.DefinedByUser;
var userDiagram = new Polygon2D();
mat.UserDiagram = userDiagram;
userDiagram.Points.Add(new Point2D() { X = -0.021, Y = 0 });
userDiagram.Points.Add(new Point2D() { X = -0.02, Y = 0 });
userDiagram.Points.Add(new Point2D() { X = -0.0025, Y = -80000000});
userDiagram.Points.Add(new Point2D() { X = -0.0024, Y = -79868660.43});
userDiagram.Points.Add(new Point2D() { X = -0.0023, Y = -79461961.9 });
userDiagram.Points.Add(new Point2D() { X = -0.0022, Y = -78762709.44});
userDiagram.Points.Add(new Point2D() { X = -0.0021, Y = -77756658.69});
userDiagram.Points.Add(new Point2D() { X = -0.0019, Y = -74785483.74	});
userDiagram.Points.Add(new Point2D() { X = -0.0017, Y = -70514061.33	});
userDiagram.Points.Add(new Point2D() { X = -0.0015, Y = -64981949.46	});
userDiagram.Points.Add(new Point2D() { X = -0.001	, Y = -46511627.91	});
userDiagram.Points.Add(new Point2D() { X = -0.0005, Y = -23904382.47	});
userDiagram.Points.Add(new Point2D() { X = 0, Y = 0});
userDiagram.Points.Add(new Point2D() { X = 0.001, Y = 0 });
//Setting thermal characteristcs of material (in this case by the code)
mat.StateOfThermalConductivity = ThermalConductivityState.Code;
mat.StateOfThermalExpansion = ThermalExpansionState.Code;
mat.StateOfThermalSpecificHeat = ThermalSpecificHeatState.Code;
mat.StateOfThermalStressStrain = ThermalStressStrainState.Code;
openModel.AddObject(mat);
Properties
 AggregateType
Type of aggregate
public ConcAggregateType AggregateType { get; set; }
Property Value
ConcAggregateType
 CalculateDependentValues
Setting calculation dependent values on fck
public bool CalculateDependentValues { get; set; }
Property Value
bool
 CementClass
Type of cement class
public ConcCementClass CementClass { get; set; }
Property Value
ConcCementClass
 DiagramType
Type of stress-strain diagram bilinear/parabolic/general for ULS calculation
public ConcDiagramType DiagramType { get; set; }
Property Value
ConcDiagramType
 Ecm
Secant modulus of elasticity of concrete - Ecm
public double Ecm { get; set; }
Property Value
double
 Epsc1
Compressive strain in the concrete - εc1
public double Epsc1 { get; set; }
Property Value
double
 Epsc2
Compressive strain in the concrete - εc2
public double Epsc2 { get; set; }
Property Value
double
 Epsc3
Compressive strain in the concrete - εc3
public double Epsc3 { get; set; }
Property Value
double
 Epscu1
Ultimate compressive strain in the concrete - εcu1
public double Epscu1 { get; set; }
Property Value
double
 Epscu2
Ultimate compressive strain in the concrete - εcu2
public double Epscu2 { get; set; }
Property Value
double
 Epscu3
Ultimate compressive strain in the concrete - εcu3
public double Epscu3 { get; set; }
Property Value
double
 Fck
Characteristic compressive cylinder strength of concrete at 28 days - fck
public double Fck { get; set; }
Property Value
double
 Fcm
Mean value of concrete cylinder compressive strength - fcm
public double Fcm { get; set; }
Property Value
double
 Fctk_0_05
Characteristic axial tensile strength of concrete 5% quantile - fctk,0,05
public double Fctk_0_05 { get; set; }
Property Value
double
 Fctk_0_95
Characteristic axial tensile strength of concrete 95% quantile - fctk,0,95
public double Fctk_0_95 { get; set; }
Property Value
double
 Fctm
Mean value of axial tensile strength of concrete - fctm
public double Fctm { get; set; }
Property Value
double
 NFactor
Coefficient n-factor - necessary parabolic part of stress-strain diagram - n
public double NFactor { get; set; }
Property Value
double
 PlainConcreteDiagram
Stress strain diagram with tension part
public bool PlainConcreteDiagram { get; set; }
Property Value
bool
 SilicaFume
Contains silica fume
public bool SilicaFume { get; set; }
Property Value
bool
 StoneDiameter
Diameter of stone
public double StoneDiameter { get; set; }
Property Value
double
 UserDiagram
Stress-strain diagram defined by user
public Polygon2D UserDiagram { get; set; }
Property Value
Polygon2D
 Edit this page